<!-- Реализуйте __call таким образом, чтобы можно было вызывать методы название которых в формате add[Число]Points()(например: add5Points(), add1Points(), add1191919Points())

Эти методы должны увеличивать свойство $points на то значение, которое содержится между add и Points в названии метода.

Также должен быть возможен вызов метода

addPoints($point)
, который должен прибавлять значение необязательного аргумента point к свойству point к свойств уpoints. А если же $point не был передан, то должна прибавляться единица.
-->


<?php

